src/cf/InformationRegisters/GDS_СоответствияОбъектовИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_СоответствияОбъектовИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектВыгруженПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_СоответствияОбъектовИнформационныхБаз/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьОбъект(Команда)
	мВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	СоздатьОбъектНаСервере(мВыделенныеСтроки);
	
	Элементы.Список.Обновить();
КонецПроцедуры  

&НаСервере
Процедура СоздатьОбъектНаСервере(мВыделенныеСтроки)
	
	Для каждого Строка Из мВыделенныеСтроки Цикл
		
		МенеджерЗаписи = РегистрыСведений.GDS_СоответствияОбъектовИнформационныхБаз.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УзелИнформационнойБазы = Строка.УзелИнформационнойБазы;	
		МенеджерЗаписи.УникальныйИдентификаторИсточника = Строка.УникальныйИдентификаторИсточника;	
		МенеджерЗаписи.ТипПриемника = Строка.ТипПриемника;	
		МенеджерЗаписи.Прочитать();
		 
		Если ЗначениеЗаполнено(МенеджерЗаписи.СсылкаНаОбъект) Тогда
			Сообщить("В строке с УИН: " + Строка.УникальныйИдентификаторИсточника + " заполнен реквизит ""СсылкаНаОбъект""!!!");
			Продолжить;
		КонецЕсли;

		ПолноеИмя = Метаданные.НайтиПоТипу(Тип(МенеджерЗаписи.ТипПриемника)).ПолноеИмя(); 
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		Если ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
			Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта) Тогда
			
			УИД = Новый УникальныйИдентификатор(МенеджерЗаписи.УникальныйИдентификаторИсточника);
			
			СправочникСсылка = МенеджерОбъекта.ПолучитьСсылку(УИД);
			
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
			Если СправочникОбъект = Неопределено Тогда
				СправочникОбъект = МенеджерОбъекта.СоздатьЭлемент();
                СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
			КонецЕсли;
			
			СправочникОбъект.Наименование = МенеджерЗаписи.ОписаниеИсточника;
			СправочникОбъект.ОбъектВыгруженПоСсылке = Истина;
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
		//ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъектаИС) Тогда
		//	ОбъектИС = МенеджерОбъектаИС.СоздатьДокумент();
		//ИначеЕсли ОбщегоНазначения.ЭтоПланВидовРасчета(МетаданныеОбъектаИС) Тогда
		//	ОбъектИС = МенеджерОбъектаИС.СоздатьВидРасчета();
		//ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(МетаданныеОбъектаИС) Тогда
		//	ОбъектИС = МенеджерОбъектаИС.СоздатьБизнесПроцесс();
		//ИначеЕсли ОбщегоНазначения.ЭтоЗадача(МетаданныеОбъектаИС) Тогда
		//	ОбъектИС = МенеджерОбъектаИС.СоздатьЗадачу();
		Иначе
			ВызватьИсключение
			СтрШаблон(НСтр("ru = 'Ошибка при создании: %1'"), ПолноеИмя);
		КонецЕсли;
				
		МенеджерЗаписи.СсылкаНаОбъект = СправочникОбъект.Ссылка;
		МенеджерЗаписи.Записать();
	КонецЦикла;  
	
КонецПроцедуры
